
public class Task7 {

	public static void main(String[] args) {
//		Имате предварително въведени стойности от естествени числа,
//		въведени в квадратна таблица с размери 6 реда и 6 колони.
//		Да се състави програма , чрез която се намира сумата на всички
//		елементи, чиято сума на индекси за ред и колона е четно число.
//		Програмата да извежда формираните суми за всеки отделен ред на
//		квадратната таблица, както и общата сума от тези елементи.
//		Да се използва само един цикъл.
		
	    int sum=0;
		int sumAll=0;

		int[][] array = {
			{11,12,13,14,15,16},
			{21,22,23,24,25,26},
			{31,32,33,34,35,36},
			{41,42,43,44,45,46},
			{51,52,53,54,55,56},
			{61,62,63,64,65,66}
		};
		int n = array.length;
		for (int row = 0; row < n; row++){
			for(int col=0 ; col < n ; col++ ){
				if((row+col)%2==0){
				
				System.out.print(array[row][col] + " "); 
				sum+=array[row][col];
				}
			}
			sumAll+=sum;
			System.out.println("Сумата е : " + sum);
			sum=0;
		}
		System.out.println("Сумата от елементите е : " + sumAll);
	}

}
