

public class Task6 {

	public static void main(String[] args) {
//		Имате предварително въведени стойности от естествени числа.
//		Числата са въведени в квадратна таблица с размери 6 реда и 6
//		колони.
//		Да се състави програма, чрез която се намира сумата на всички
//		елементи от редовете с четни номера: 2,4 и 6.
//		Програмата да извежда и сумата на всеки отделен ред.

		
		int sum=0;
		int sumAll=0;
		int[][] array = {
			{11,12,13,14,15,16},
			{21,22,23,24,25,26},
			{31,32,33,34,35,36},
			{41,42,43,44,45,46},
			{51,52,53,54,55,56},
			{61,62,63,64,65,66}
		};
		int n = array.length;
		
		for (int row = 1; row < n; row+=2){
			for(int col=0 ; col < n ; col++ ){
				System.out.print(array[row][col] + " "); 
				sum+=array[row][col];
			}
			sumAll+=sum;
			System.out.println("Сумата е : " + sum);
			sum=0;
		}
		System.out.println("Сумата от елементите е " + sumAll);

	}

}
